src/cf/DataProcessors/ПанельАдминистрированияБесшовнойИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПанельАдминистрированияБесшовнойИнтеграции</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеИнтегрированныхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеИнтегрированныхСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнтегрированнойСистемы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтегрированныеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ПанельАдминистрированияБесшовнойИнтеграции/Forms/ДобавлениеИнтегрированнойСистемы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
#Если Не ВебКлиент Тогда
	// Добавим в список выбора имя пользователя ИС.
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Элементы.ИмяПользователя.СписокВыбора.Добавить(ПользовательИБ.Имя);
	Элементы.ИмяПользователя.КнопкаВыпадающегоСписка = Истина;
#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	Закрыть(ДобавитьНаСервере());
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ПроверитьПодключениеНаСервере();
	ПоказатьПредупреждение(,НСтр("ru = 'Подключение установлено успешно'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДобавитьНаСервере()
	
	Прокси = РаботаСИнтегрированнымиСистемами.ПолучитьПрокси(АдресСервиса, ИмяПользователя, Пароль);
	
	МетаданныеИС = РаботаСИнтегрированнымиСистемами.СтруктураМетаданныхСистемыИнтегрированнойБесшовно(Прокси);
	
	ИдентификаторУзла = МетаданныеИС.dataBaseID;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИнтегрированныеСистемы.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ИнтегрированныеСистемы КАК ИнтегрированныеСистемы
		|ГДЕ
		|	ИнтегрированныеСистемы.Идентификатор = &ИдентификаторУзла");
	Запрос.УстановитьПараметр("ИдентификаторУзла", ИдентификаторУзла);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	Попытка
		
		Если Выборка.Следующий() Тогда
			УзелОбъект = Выборка.Ссылка.ПолучитьОбъект();
			УзелОбъект.Заблокировать();
		Иначе
			УзелОбъект = ПланыОбмена.ИнтегрированныеСистемы.СоздатьУзел();
			Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторУзла) Тогда
				СсылкаНовогоУзла = ПланыОбмена.ИнтегрированныеСистемы.ПолучитьСсылку(
					Новый УникальныйИдентификатор(ИдентификаторУзла));
				УзелОбъект.УстановитьСсылкуНового(СсылкаНовогоУзла);
			КонецЕсли;
			УзелОбъект.УстановитьНовыйКод();
			УзелОбъект.Идентификатор = ИдентификаторУзла;
		КонецЕсли;
		
		УзелОбъект.Наименование = ?(ЗначениеЗаполнено(ИмяИС), ИмяИС, МетаданныеИС.dataBaseName);
		УзелОбъект.АдресВебСервиса = АдресСервиса;
		УзелОбъект.ПоддерживаетПравилаЗагрузкиДанныхВДО = Истина;
		УзелОбъект.Записать();
		
		РегистрыСведений.ДанныеИнтегрированныхСистем.ЗаписатьДанные(УзелОбъект.Ссылка, ИмяПользователя, Пароль);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			РаботаСИнтегрированнымиСистемами.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат УзелОбъект.Ссылка;
	
КонецФункции

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	
	Прокси = РаботаСИнтегрированнымиСистемами.ПолучитьПрокси(АдресСервиса, ИмяПользователя, Пароль);
	
	МетаданныеИС = РаботаСИнтегрированнымиСистемами.СтруктураМетаданныхСистемыИнтегрированнойБесшовно(Прокси);
	
	Если Не ЗначениеЗаполнено(ИмяИС) Тогда
		ИмяИС = МетаданныеИС.dataBaseName;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
